
Java

一  面向对象
 
1.	理解
从现实到抽象
   客观存在的人 事 物 就是对象
具有共同特征和行为的对象集合称之为类
从抽象到具体
  类事对象的泛化
  对象是类的具体化  实例化
2 思想
编程思想：面向对象⬅➡人类的思维
面向对象思考过程： 面向对象分析OOA  面向对象设计 OOD  面向对象编程OOP4
UML➡编程语言：C C++,C#
3 JAVA编写类
 访问修饰符  非访问修饰符   class  类名  extends父类名{
		属性定义
			访问修饰符  非访问修饰符 数据类型  属性名称
		方法定义
			访问修饰符  非访问修饰符 返回类型 方法名称
}
访问修饰符 ：private  public  默认  protected
非访问修饰符： static  final  abstract  native	
数值类型： 8种基本数据类型是值类型：byte short int long float double char boolean
			其他类型：类 接口 枚举
属性：
	子类中属性名和父类中属性同名时 字段隐藏，隐藏父类的属性 只看子类属性
	存取器 setter getter
方法:
	 方法重载
	 方法重写
	 构造器
4.三大特性
 	封装：隐藏内部实现细节  对外公开访问接口
		访问修饰符
		存取器
		方法的提取
继承：子类继承父类所在成员（除构造器外）
	代码重用
	模拟现实世界
  多态：同一种行为具有不同表现
 		编译时多态➡方法重载  参数的改变造成方法调用的不同
		运行时多态➡方法重写  发生在子类与父类方法名相同 父类方法名隐藏
